feat(medium): spec finish
